---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.VerticalAlignment
source: html/c95f19e3-8b86-5255-a814-4096384eb856.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.VerticalAlignment Property

Indicates if the vertical alignment characteristic is overridden.

## Syntax (C#)
```csharp
public bool VerticalAlignment { get; set; }
```